# Level 1

In [1]:
import numpy as np
import pandas as pd

In [2]:
'''
1. Load +he sales da+ase+ (e.g., 'sales.csv') in+o a Pandas Da+aFrame.
2. Display +he frs+ 5 rows o: +he da+ase+.
3. Check +he shape (number o: rows and columns) o: +he da+ase+.
4. Display basic s+aAsAcs (mean, median, min, max) :or +he 'Sales' column.
5. De+ermine +he number o: unique produc+s sold.
'''

"\n1. Load +he sales da+ase+ (e.g., 'sales.csv') in+o a Pandas Da+aFrame.\n2. Display +he frs+ 5 rows o: +he da+ase+.\n3. Check +he shape (number o: rows and columns) o: +he da+ase+.\n4. Display basic s+aAsAcs (mean, median, min, max) :or +he 'Sales' column.\n5. De+ermine +he number o: unique produc+s sold.\n"

### 1. Load all datasets into pandas dataframe

In [3]:
regions = pd.read_csv("regions.csv")
products = pd.read_csv("products.csv")
customers = pd.read_csv("customers.csv")
sales = pd.read_csv("sales.csv")

### 2. Display first 5 rows of the datasets

In [4]:
regions.head()

   region_id region_name
0          1  East Coast
1          2  West Coast
2          3     Midwest
3          4       South
4          5   Northeast

In [5]:
products.head()

   product_id product_name     category  price
0         101    Product A  Electronics    500
1         102    Product B     Clothing    800
2         103    Product C   Home Decor    300
3         104    Product D  Electronics   1000
4         105    Product E       Beauty   1500

In [6]:
customers.head()

,customer_id,customer_name,email,address
0,201,John Doe,john@example.com,"123 Main St, Anytown, USA"
1,202,Jane Smith,jane@example.com,"456 Elm St, Othertown, USA"
2,203,Robert Brown,robert@example.com,"789 Oak St, Anycity, USA"
3,204,Lisa Johnson,lisa@example.com,"321 Maple St, Somewhere, USA"
4,205,Michael Wilson,michael@example.com,"654 Pine St, Nowhere, USA"

In [7]:
sales.head()

   sales_id  product_id  customer_id        date  region_id  sales_amt
0         1         198          259  2015-01-04          7       1400
1         2         104          266  2015-01-05          6       1000
2         3         158          219  2015-01-05          8       1400
3         4         141          295  2015-01-06          6        900
4         5         184          295  2015-01-07         10       1200

### 3. Check the shapes of the datasets

In [8]:
print("Shape of regions table = ",regions.shape)
print("Shape of products table = ",products.shape)
print("Shape of customers table = ",customers.shape)
print("Shape of sales table = ",sales.shape)

Shape of regions table =  (10, 2)
Shape of products table =  (98, 4)
Shape of customers table =  (99, 4)
Shape of sales table =  (1000, 6)

### 4. Display basic statistics (mean, median, min, max) for the 'sales_amt' column.

In [9]:
sales.sales_amt.describe()

count    1000.000000
mean     1367.800000
std       597.168125
min       300.000000
25%       850.000000
50%      1400.000000
75%      1800.000000
max      2500.000000
Name: sales_amt, dtype: float64

### 5.  Display the number of unique products sold

In [10]:
sales.product_id.nunique()

98